Revit 2027 API
SketchedStairsCurveData.GetCurve Method
 Get a copy of the curve that is formed along this boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
 A copy of the curve.
See Also
Reference
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace